notes/meeting_2021jul11.md
- [meeting notes July 11, 2021](#org4f0ff73)
  - [starry dynamo of night](#orgc5ab639)
    - [relative path from program to other directory](#org09efad4)
    - [working towards a Data::Math for raku: dualmap](#org2bb7d74)
    - [small bits related to dualmap project](#org1d929ee)


<a id="org4f0ff73"></a>

# meeting notes July 11, 2021


<a id="orgc5ab639"></a>

## starry dynamo of night


<a id="org09efad4"></a>

### relative path from program to other directory

1.  /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021mar28/program<sub>location.raku</sub>

2.  Q: how to get that to work with "use lib"

    1.  BEGIN?


<a id="org2bb7d74"></a>

### working towards a Data::Math for raku: dualmap

1.  /home/doom/End/Cave/DataMathRaku/Wall/Data-MapDual/lib/Data/Qualify.rakumod

2.  /home/doom/End/Cave/DataMathRaku/Wall/Data-MapDual/t/01-qualify<sub>dyad.t</sub>

3.  /home/doom/End/Cave/DataMathRaku/Wall/Data-MapDual/lib/Data/MapDual.rakumod

4.  /home/doom/End/Cave/DataMathRaku/Notes/notes-dualmap


<a id="org1d929ee"></a>

### small bits related to dualmap project

1.  distinguishing between Positional and Associative

2.  creating new entries of same type as old
